Revit 2027 API
IFCFileWriteOptions Constructor
 Creates a default IFCFileWriteOptions. The default file format is ifc.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCFileWriteOptions()
Public Sub New
public:
IFCFileWriteOptions()
new : unit -> IFCFileWriteOptions
See Also
Reference
IFCFileWriteOptions Class
Autodesk.Revit.DB.IFC Namespace